Repository: MichaelDiers/document-packer
Catalog: DocumentPacker/DocumentPacker/Parts/Main/CreateConfigurationPart/Translations/CreateConfigurationPartTranslation.*.resx
Languages: de

# ViewDescription
source: Make a list of required files and information. Save the list as a configuration and share it with other Document Packer users.
de: Erstelle eine Liste von benötigten Dateien und Informationen. Speichere die Liste als Konfiguration ab und teile diese mit anderen Document Packer Benutzern.

# ViewHeadline
source: Create Configuration
de: Konfiguration anlegen

# DescriptionLabel
source: Description
de: Beschreibung

# DescriptionToolTip
source: Describe the new Document Packer configuration. The description will be displayed when encrypting files.
de: Beschreibe die neue Document Packer Konfiguration. Die Beschreibung wird bei der Verschlüsselung von Dateien angezeigt.

# DescriptionWatermark
source: my secret data collection
de: meine geheimen Daten

# RsaPrivateKeyLabel
source: RSA Private Key
de: RSA: Privater Schlüssel

# RsaPublicKeyLabel
source: RSA Public Key
de: RSA: Öffentlicher Schlüssel

# RsaPublicKeyButtonToolTip
source: Add the RSA public key.
de: Füge den öffentlichen RSA Schlüssel hinzu.

# RsaPrivateKeyToolTip
source: The pem formatted private RSA key: -----BEGIN RSA PRIVATE KEY----- MIIJJwIBAAKCAgEAwYzNBVaGz1XT... -----END RSA PRIVATE KEY-----
de: Der private RSA Schlüssel im PEM Format: -----BEGIN RSA PRIVATE KEY----- MIIJJwIBAAKCAgEAwYzNBVaGz1XT... -----END RSA PRIVATE KEY-----

# RsaPublicKeyToolTip
source: The pem formatted public RSA key: -----BEGIN RSA PUBLIC KEY----- MIICCgKCAgEA... -----END RSA PUBLIC KEY-----
de: Der öffentliche RSA Schlüssel im PEM Format: -----BEGIN RSA PUBLIC KEY----- MIICCgKCAgEA... -----END RSA PUBLIC KEY-----

# RsaPrivateKeyWatermark
source: PEM formatted private RSA key
de: Privater RSA Schlüssel im PEM Format.

# RsaPublicKeyWatermark
source: PEM formatted public RSA key
de: Öffentlicher RSA Schlüssel im PEM Format

# GenerateRsaKeysCommandToolTip
source: Generate a new pair of RSA private and public keys.
de: Generiere ein neues Paar von privatem und öffentlichem RSA Schlüsseln.

# ItemDescriptionIsRequired
source: A description is required.
de: Bitte gebe eine Beschreibung an.

# ItemDescriptionLabel
source: Description
de: Beschreibung

# ItemDescriptionToolTip
source: A short description of the configuration item.
de: Eine kurze Beschreibung des Konfigurationseintrages.

# ItemDescriptionWatermark
source: The file contains the secrets of the world.
de: Die Datei enthält die Geheimnisse der Welt.

# DeleteConfigurationItemCommandToolTip
source: Delete the configuration item.
de: Lösche den Konfigurationseintrag

# DescriptionIsRequired
source: A description is required.
de: Bitte gebe eine Beschreibung an.

# AddConfigurationItemToolTip
source: Add a new configuration item.
de: Füge einen neuen Konfigurationseintrag hinzu.

# ConfigurationItemTypeLabel
source: Type of the Item
de: Typ

# ConfigurationItemTypeWatermark
source: Please select
de: Bitte auswählen

# ConfigurationItemTypeFile
source: File
de: Datei

# OpenFileDialogToolTip
source: Select a file to add.
de: Wähle eine Datei aus.

# IsRequiredLabel
source: Required
de: Pflichtangabe

# PasswordLabel
source: Password
de: Passwort

# SaveLabel
source: Save
de: Speichern

# SaveToolTip
source: Save the public and private configuration files.
de: Speichere die öffentliche und private Konfigurationsdateien.

# SelectedConfigurationItemTypeMissing
source: Please select.
de: Bitte auswählen.

# RsaPrivateKeyIsRequired
source: Private RSA key is required.
de: Bitte gebe einen privaten RSA Schlüssel an.

# RsaPublicKeyIsRequired
source: Public RSA key is required.
de: Bitte gebe einen öffentlichen RSA Schlüssel an.

# OutputFolderLabel
source: Output Folder
de: Ausgabeverzeichnis

# OutputFolderToolTip
source: The output folder of the Document Packer configuration file.
de: Das Ausgabeverzeichnis der Document Packer Konfigurationsdatei

# OutputFolderWatermark
source: c:\data\secret_data
de: c:\daten\streng_geheim

# PrivateOutputFileLabel
source: Private Output File
de: Private Konfigurationsdatei

# PrivateOutputFileIsRequired
source: File is required.
de: Bitte gebe einen Dateinamen an.

# PrivateOutputFileToolTip
source: Please specify the name of the private Document Packer configuration file.
de: Bitte gebe den Namen der privaten Document Packer Konfigurationsdatei an.

# PrivateOutputFileWatermark
source: PrivateConfigurationFile
de: PivateKonfiguration

# PrivateOutputFileExtensionToolTip
source: The predefined file extension of the private Document Packer configuration file.
de: Die Dateiendung der privaten Document Packer Konfigurationsdatei.

# PublicOutputFileLabel
source: Public Output File
de: Öffentliche Konfigurationsdatei

# PublicOutputFileToolTip
source: Please specify the name of the public Document Packer configuration file.
de: Bitte gebe den Namen der öffentlichen Document Packer Konfigurationsdatei an.

# PublicOutputFileWatermark
source: PublicConfigurationFile
de: ÖffentlicheKonfiguration

# PublicOutputFileIsRequired
source: File is required.
de: Bitte gebe einen Dateinamen an.

# PublicOutputFileExtensionToolTip
source: The predefined file extension of the public Document Packer configuration file.
de: Die Dateiendung der öffentlichen Document Packer Konfigurationsdatei.

# OutputFolderIsRequired
source: Please select the output folder.
de: Bitte wähle das Ausgabeverzeichnis aus.

# PasswordToolTip
source: Specify a password to protect the configuration files.
de: Die Konfigurationsdateien werden mit diesem Passwort geschützt.

# PasswordIsRequired
source: A password is required.
de: Bitte gebe ein Passwort an.

# SaveConfigurationSucceeds
source: Configuration files created.
de: Konfigurationsdateien erstellt.

# SaveConfigurationFails
source: Cannot create configuration files.
de: Konfigurationsdateien konnten nicht erstellt werden.

# GenerateRsaKeysCommandUnknownError
source: Ooooops...an unexpected error occured:
de: Ooooops...ein Fehler hat sich eingeschlichen:

# GenerateRsaKeysCommandCaption
source: Error
de: Fehler

# RsaPrivateKeyFormatError
source: Format of the private key is invalid.
de: Format des RSA Schlüssels ist ungültig.

# RsaPublicKeyFormatError
source: Format of the public key is invalid.
de: Format des RSA Schlüssels ist ungültig.

# IdWatermark
source: SecretFile
de: Geheimakte

# IdToolTip
source: Enter a unique name or ID for the entry. This name will be used as the file name when decrypting the Document Packer entry. These characters must not be used: ", <, >, |, :, *, ?, \, /
de: Hinterlege einen eindeutigen Namen oder eine Id für den Eintrag. Bei der Entschlüsselung des Document Packer Eintrages wird dieser Name als Dateiname verwendet. Diese Zeichen dürfen nicht verwendet werden: ", <, >, |, :, *, ?, \, /"

source: id is required
de: Bitte gebe einen Namen an

# IdConatainsInvalidCharacters
source: id contains invalid characters
de: Name enthält ungültige Zeichen

# ConfigurationItemTypeToolTip
source: Specify whether the secret data is a file or plaintext.
de: Gebe an, ob es sich bei den geheimen Daten um eine Datei oder einen Text handelt.

# IsRequiredToolTip
source: Indicates wheather the entry is required or optional.
de: Gibt an, ob die Eingabe erforderlich oder optional ist.

# OutputFolderDoesNotExist
source: Folder does not exist.
de: Verzeichnis existiert nicht.

# PrivateOutputFileDoesExist
source: File already exists.
de: Datei existiert bereits.

# PublicOutputFileDoesExist
source: File already exists.
de: Datei existiert bereits.

# SaveCommandUnknownError
source: An unknown error occured.
de: Ein unerwarteter Fehler ist aufgetreten.

# IdDuplicate
source: Name used multiple times.
de: Name mehrfach verwendet.

# CancelLabel
source: Abort
de: Abbrechen

# SaveCancelInfoText
source: Saving the Document Packer configuration in progress.
de: Speichere die Document Packer Konfiguration.

# GenerateRsaKeysCommandCancelInfoText
source: RSA keys are generated.
de: RSA-Schlüssel werden generiert.
