Repository: MichaelDiers/document-packer
Catalog: DocumentPacker/DocumentPacker/Resources/Translation.*.resx
Languages: de

# BackLinkPartBack
source: Back
de: Zurück

# BackLinkPartChangeLanguage
source: Change the language of the application.
de: Ändere die Sprache der Anwendung.

# BackLinkPartRestartCaption
source: Restart now?
de: Jetzt Neustarten?

# BackLinkPartRestartRequest
source: To change the language you must restart the application. Would you like to restart now?
de: Um die Sprache zu ändern, müssen Sie die Anwendung neu starten. Möchten Sie jetzt neu starten?

# ChangeLanguagePartDescription
source: Change the Document Packer language settings and select a different language.
de: Ändere die Spracheinstellungen des Document Packers und wähle eine andere Sprache aus.

# ChangeLanguagePartHeadline
source: Language Settings
de: Spracheinstellungen

# DocumentPackerPartTitle
source: DocumentPacker (en)
de: DocumentPacker (de)

# EncryptItemTypeFile
source: File
de: Datei

# EncryptStartUpPartCreateConfiguration
source: Create configuration
de: Konfiguration anlegen

# EncryptStartUpPartCreateConfigurationDescription
source: Create a DocumentPacker configuration file.
de: Erstelle eine neue DocumentPacker Konfiguration.

# EncryptStartUpPartLoadConfiguration
source: Load configuration
de: Konfiguration laden

# EncryptStartUpPartLoadConfigurationDescription
source: Load a DocumentPacker configuration file, pack and encrypt files.
de: Lade eine DocumentPacker Konfiguration.

# FeaturesPartCreateConfigDescription
source: Make a list of required files and information. Save the list as a configuration and share it with other Document Packer users.
de: Erstelle eine Liste von benötigten Dateien und Informationen. Speichere die Liste als Konfiguration ab und teile diese mit anderen Document Packer Benutzern.

# FeaturesPartCreateConfigHeadline
source: Create Configuration
de: Konfiguration anlegen

# FeaturesPartDecryptDescription
source: Have you been sent an encrypted Document Packer file? Decrypt the Document Packer file with your private key. View or save the decrypted files.
de: Du hast eine verschlüsselte Document Packer Datei zugesendet bekommen? Entschlüssele die Document Packer-Datei mit Deinem privaten Schlüssel. Sieh Dir die entschlüsselten Dateien an oder speichere diese ab.

# FeaturesPartDecryptHeadline
source: Decrypt
de: Entschlüsseln

# FeaturesPartEncryptDescription
source: Do you want to encrypt files and information? Generate your personal keys for encryption. Create an encrypted Document Packer file and send it to your friends.
de: Du möchstest Dateien und Informationen verschlüsseln? Generiere Deine persönlichen Keys zum Verschlüsseln. Erstelle eine verschlüsselte Document Packer Datei und versende diese an Deine Freunde.

# FeaturesPartEncryptHeadline
source: Encrypt
de: Verschlüsseln

# FeaturesPartHeadline
source: Welcome back! What can we do for you?
de: Willkommen zurück! Was können wir für Dich erledigen?

# LanguageName
source: English
de: Deutsch

# StartUpPartDecrypt
source: Decrypt
de: Entschlüsseln

# StartUpPartDecryptDescription
source: Decrypt documents and text.
de: Entschlüssele Dateien und Texte.

# StartUpPartEncrypt
source: Encrypt
de: Verschlüsseln

# StartUpPartEncryptDescription
source: Encrypt documents and text.
de: Verschlüssele Dokumente and Texte.

# EncryptItemTypeNone
source: Please select
de: Bitte auswählen

# EncryptPartFileIsRequired
source: Please select a file.
de: Bitte wählen Sie eine Datei aus.

# EncryptPartFileDoesNotExists
source: The file does not exist.
de: Die Datei existiert nicht.

# EncryptPartIsRequiredLabel
source: Is Required
de: Pflichtangabe

# EncryptPartDescriptionLabel
source: Description
de: Beschreibung

# EncryptPartDataTypeLabel
source: Data Type
de: Datentyp

# EncryptPartAttachFileLabel
source: Attach a file.
de: Datei hinzufügen.

# EncryptPartDeleteLabel
source: Delete the item.
de: Eintrag löschen.

# EncryptPartAddLabel
source: Add a new item.
de: Neuen Eintrag hinzufügen.

# EncryptPartTextIsRequired
source: Please enter a custom text.
de: Bitte gebe einen Text ein.

# EncryptPartEncrypt
source: Encrypt & Pack
de: Verschlüsseln

# EncryptPartDocumentPackerFile
source: Document Packer File
de: Document Packer Datei

# SelectDocumentPackerOutputFolderCommand
source: Select the output folder of the document packer file.
de: Wähle den Ausgabeordner der Dokument-Packer-Datei aus.

# DocumentPackerOutputFolderToolTip
source: The output folder of the document packer file.
de: Der Ausgabeordner der Dokument Packer-Datei.

source: Directory does not exist.
de: Verzeichnis existiert nicht.

# DocumentPackerOutputFileToolTip
source: The name of the Document Packer file.
de: Name der Document Packer Datei.

# FileNameIsMissing
source: Please enter a file name.
de: Bitte gib einen Dateinamen an.

# EncryptPartRsaPublicKeyToolTip
source: RSA public key in PEM format.
de: RSA Public Key im PEM Format.

# EncryptPartGenerateRsaKeys
source: Generate a new RSA public and private key pair.
de: Generiere ein neues öffentliches und privates RSA-Schlüsselpaar.

# EncryptPartRsaPrivateKeyToolTip
source: RSA private key in PEM format.
de: RSA Private Key im PEM Format.

# EncryptPartItemsHeadline
source: Add Files and Plain-Text
de: Füge Dateien und Text hinzu

# EncryptPartCollapseAll
source: Collapse All
de: Alles zuklappen

# EncryptPartExpandAll
source: Expand All
de: Alles aufklappen

# ArchiveIdToolTip
source: The id of the archive entry.
de: Die eindeutige Id des Archiv Eintrages.

# ArchiveIdExtensionToolTip
source: The extension of the archive entry.
de: Die Dateierweiterung des Archiveintrages.
